---
kind: type
id: T:Autodesk.Revit.DB.FailureMessageAccessor
source: html/753477d8-b720-97a0-26f5-439d49de418c.htm
---
# Autodesk.Revit.DB.FailureMessageAccessor

Restricted accessor for FailureMessage.

## Syntax (C#)
```csharp
public class FailureMessageAccessor : IDisposable
```

## Remarks
Provides access to a FailureMessage stored in a Document. Reading of the information from the FailureMessage is allowed,
 changing of information is generally not allowed, except setting of the current resolution type.